Documents/ЗавершениеРаботыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗавершениеРаботыОрганизации</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаДанныхДолжника</xr:Item>
				<xr:Item>Document.ЗагрузкаДанных</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоКатегориям</xr:Item>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
				<xr:Item>AccumulationRegister.ИсковыеТребования</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СостоянияПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>СостоянияПоКатегориям</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Скоринг</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСкоринга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектам</Name>
			<Comment>Трейд Софт Задолженность по долговому обязательству</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>Дополнительная аналитика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоСудебнымРешениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоСудебнымРешениям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьРешения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженностиПоРешению</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗавершениеРаботыОрганизации/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицыДвижений) Экспорт
	
	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период",	ЭтотОбъект.Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Дата",	ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Автор",	ЭтотОбъект.Автор);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	ИнициализироватьДанныеОбъектыСобытия(
		Запрос,
		ТаблицыДвижений["Объекты"],
		ТаблицыДвижений["События"]
	);
	
	ИнициализироватьДанныеОтветственные(
		Запрос,
		ТаблицыДвижений["Ответственные"]
	);
	
	
	//ТаблицаДвиженийКатегории = ТаблицыДвижений["Категории"];
	//ТаблицаДвиженийЗадолженность = ТаблицыДвижений["Задолженность"];
	//ТаблицаДвиженийЗадолженностьВнесудебная = ТаблицыДвижений["ЗадолженностьВнесудебна"];
	//ТаблицаДвиженийЗадолженностьСудебная = ТаблицыДвижений["ЗадолженностьСудебная"];
	//ТаблицаДвиженийЗадолженностьИск = ТаблицыДвижений["ЗадолженностьИск"];
	//
	Если ЭтотОбъект.ОбнулитьКатегории ИЛИ ЭтотОбъект.ОбнулитьЗадолженность Тогда
		Запрос.УстановитьПараметр("Объекты", ЭтотОбъект.Объекты.Выгрузить().ВыгрузитьКолонку("Объект"));
		
	КонецЕсли;
	
	Если ЭтотОбъект.ОбнулитьКатегории Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	&Дата КАК Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	СостоянияПоКатегориямОстатки.Скоринг,
		               |	СостоянияПоКатегориямОстатки.Категория,
		               |	СостоянияПоКатегориямОстатки.Объект,
		               |	СостоянияПоКатегориямОстатки.КоличествоОстаток КАК Количество
		               |ИЗ
		               |	РегистрНакопления.СостоянияПоКатегориям.Остатки(&Период, Объект В (&Объекты)) КАК СостоянияПоКатегориямОстатки";	
		ТаблицаДвиженийКатегории = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если ЭтотОбъект.ОбнулитьЗадолженность Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	&Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ЗадолженностьПоОбъектамОстатки.Объект КАК Объект,
		|	ЗадолженностьПоОбъектамОстатки.СуммаДООстаток КАК СуммаДО,
		|	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРегл,
		|	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДО,
		|	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРегл,
		|	ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток КАК ПроцентыДО,
		|	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРегл,
		|	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРегл,
		|	ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток КАК ШтрафыДО,
		|	ЗадолженностьПоОбъектамОстатки.ПениДООстаток КАК ПениДО,
		|	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток КАК ПениРегл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая1ДООстаток КАК Составляющая1ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток КАК Составляющая1Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая2ДООстаток КАК Составляющая2ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток КАК Составляющая2Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая3ДООстаток КАК Составляющая3ДО,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток КАК Составляющая3Регл,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая4ДООстаток КАК Составляющая4ДООстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток КАК Составляющая4РеглОстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая5ДООстаток КАК Составляющая5ДООстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток КАК Составляющая5РеглОстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая6ДООстаток КАК Составляющая6ДООстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток КАК Составляющая6РеглОстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая7ДООстаток КАК Составляющая7ДООстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток КАК Составляющая7РеглОстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая8ДООстаток КАК Составляющая8ДООстаток,
		|	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток КАК Составляющая8РеглОстаток
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&Период, Объект В (&Объекты)) КАК ЗадолженностьПоОбъектамОстатки";	
		ТаблицаДвиженийЗадолженность = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	&Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект КАК Объект,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток КАК СуммаДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаРеглОстаток КАК СуммаРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыДООстаток КАК ПроцентыДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыРеглОстаток КАК ПроцентыРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыДООстаток КАК ШтрафыДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыРеглОстаток КАК ШтрафыРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениДООстаток КАК ПениДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениРеглОстаток КАК ПениРегл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1ДООстаток КАК Составляющая1ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1РеглОстаток КАК Составляющая1Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2ДООстаток КАК Составляющая2ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2РеглОстаток КАК Составляющая2Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3ДООстаток КАК Составляющая3ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3РеглОстаток КАК Составляющая3Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4ДООстаток КАК Составляющая4ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4РеглОстаток КАК Составляющая4Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5ДООстаток КАК Составляющая5ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5РеглОстаток КАК Составляющая5Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6ДООстаток КАК Составляющая6ДОк,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6РеглОстаток КАК Составляющая6Регл,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7ДООстаток КАК Составляющая7ДОк,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7РеглОстаток КАК Составляющая7Реглк,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8ДООстаток КАК Составляющая8ДО,
		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8РеглОстаток КАК Составляющая8Регл
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки(&Период, Объект В (&Объекты)) КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки";
		ТаблицаДвиженийЗадолженностьВнесудебная = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	&Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ЗадолженностьПоСудебнымРешениямОстатки.Займ КАК Займ,
		|	ЗадолженностьПоСудебнымРешениямОстатки.Решение КАК Решение,
		|	ЗадолженностьПоСудебнымРешениямОстатки.ЧастьРешения КАК ЧастьРешения,
		|	ЗадолженностьПоСудебнымРешениямОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки(&Период, Займ В (&Объекты)) КАК ЗадолженностьПоСудебнымРешениямОстатки"; 
		ТаблицаДвиженийЗадолженностьСудебная = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	&Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ИсковыеТребованияОстатки.Займ КАК Займ,
		|	ИсковыеТребованияОстатки.СуммаОсновнойДолгОстаток КАК СуммаОсновнойДолг,
		|	ИсковыеТребованияОстатки.СуммаПроцентыОстаток КАК СуммаПроценты,
		|	ИсковыеТребованияОстатки.СуммаШтрафыОстаток КАК СуммаШтрафы,
		|	ИсковыеТребованияОстатки.СуммаПениОстаток КАК СуммаПени,
		|	ИсковыеТребованияОстатки.ЦенаИскаОстаток КАК ЦенаИска,
		|	ИсковыеТребованияОстатки.СуммаГоспошлинаОстаток КАК СуммаГоспошлина
		|ИЗ
		|	РегистрНакопления.ИсковыеТребования.Остатки(&Период, Займ В (&Объекты)) КАК ИсковыеТребованияОстатки";		
		ТаблицаДвиженийЗадолженностьИск = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ТаблицыДвижений["Категории"] = ТаблицаДвиженийКатегории;
	ТаблицыДвижений["Задолженность"] = ТаблицаДвиженийЗадолженность;
	ТаблицыДвижений["ЗадолженностьВнесудебна"] = ТаблицаДвиженийЗадолженностьВнесудебная;
	ТаблицыДвижений["ЗадолженностьСудебная"] = ТаблицаДвиженийЗадолженностьСудебная;
	ТаблицыДвижений["ЗадолженностьИск"] = ТаблицаДвиженийЗадолженностьИск;

КонецПроцедуры

Процедура ИнициализироватьДанныеОбъектыСобытия(Запрос, ТаблицаДвиженийОбъекты, ТаблицаДвиженийСобытия)

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗавершениеРаботыОрганизацииОбъекты.Объект,
	               |	ЗавершениеРаботыОрганизацииОбъекты.Ссылка КАК Регистратор,
	               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
	               |	ОбъектыВРаботеОстатки.Сотрудник,
	               |	ОбъектыВРаботеОстатки.Организация,
	               |	ОбъектыВРаботеОстатки.Подразделение
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	Документ.ЗавершениеРаботыОрганизации.Объекты КАК ЗавершениеРаботыОрганизацииОбъекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(&Период, Организация = &Организация) КАК ОбъектыВРаботеОстатки
	               |		ПО ЗавершениеРаботыОрганизацииОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
	               |ГДЕ
	               |	ЗавершениеРаботыОрганизацииОбъекты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗавершениеРаботыОрганизацииОбъекты.Ссылка,
	               |	ОбъектыВРаботеОстатки.Организация,
	               |	ОбъектыВРаботеОстатки.Подразделение,
	               |	ЗавершениеРаботыОрганизацииОбъекты.Объект,
	               |	ОбъектыВРаботеОстатки.Сотрудник,
	               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Дата КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	Таблица.Сотрудник,
	               |	Таблица.Объект,
	               |	Таблица.ОстатокВРаботе КАК Количество,
	               |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
	               |	Таблица.Организация,
	               |	Таблица.Подразделение
	               |ИЗ
	               |	Таблица КАК Таблица
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОстатокВРаботе
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Дата КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ВЫБОР
	               |		КОГДА Таблица.Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА Таблица.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаОрганизации)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаПодразделения)
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаСотрудника)
	               |	КОНЕЦ КАК ВидСобытия,
	               |	Таблица.Регистратор КАК ИсточникСобытия,
	               |	Таблица.Объект,
	               |	Таблица.Сотрудник КАК Сотрудник,
	               |	&Автор,
	               |	Таблица.Подразделение КАК Подразделение
	               |ИЗ
	               |	Таблица КАК Таблица
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Подразделение УБЫВ,
	               |	Сотрудник УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Таблица";				   				   
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаДвиженийОбъекты = Результат[1].Выгрузить();
	ТаблицаДвиженийСобытия = Результат[2].Выгрузить();

КонецПроцедуры

Процедура ИнициализироватьДанныеОтветственные(Запрос, ТаблицаДвиженийОтветственные)

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗавершениеРаботыОрганизацииОбъекты.Объект КАК Объект
	               |ПОМЕСТИТЬ ВтОбъектыДляЗавершения
	               |ИЗ
	               |	Документ.ЗавершениеРаботыОрганизации.Объекты КАК ЗавершениеРаботыОрганизацииОбъекты
	               |ГДЕ
	               |	ЗавершениеРаботыОрганизацииОбъекты.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтветственныеСотрудники.ТипСотрудника КАК ТипСотрудника,
	               |	ОтветственныеСотрудники.Пользователь КАК Пользователь,
	               |	""Ответственные"" КАК ТипРегистра,
	               |	ОтветственныеСотрудники.Объект КАК Объект
	               |ИЗ
	               |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОбъектыДляЗавершения КАК ВтОбъектыДляЗавершения
	               |		ПО ОтветственныеСотрудники.Объект = ВтОбъектыДляЗавершения.Объект
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СотрудникиВПомощь.ТипСотрудника,
	               |	СотрудникиВПомощь.Пользователь,
	               |	""Помощь"",
	               |	СотрудникиВПомощь.Объект
	               |ИЗ
	               |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОбъектыДляЗавершения КАК ВтОбъектыДляЗавершения
	               |		ПО СотрудникиВПомощь.Объект = ВтОбъектыДляЗавершения.Объект";
	
	ТаблицаДвиженийОтветственные = Запрос.Выполнить().Выгрузить();

КонецПроцедуры


//Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъектыВРаботе, ТаблицаДвиженийСобытия,
//		ТаблицаДвиженийКатегории, ТаблицаДвиженийЗадолженность,ТаблицаДвиженийЗадолженностьВнесудебная,ТаблицаДвиженийЗадолженностьСудебная,ТаблицаДвиженийЗадолженностьИск) Экспорт
//	Запрос = Новый Запрос();	
//	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
//	Запрос.УстановитьПараметр("Период",	ЭтотОбъект.Ссылка.МоментВремени());
//	Запрос.УстановитьПараметр("Дата",	ЭтотОбъект.Дата);
//	Запрос.УстановитьПараметр("Автор",	ЭтотОбъект.Автор);
//	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
//	
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ЗавершениеРаботыОрганизацииОбъекты.Объект,
//	               |	ЗавершениеРаботыОрганизацииОбъекты.Ссылка КАК Регистратор,
//	               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
//	               |	ОбъектыВРаботеОстатки.Сотрудник,
//	               |	ОбъектыВРаботеОстатки.Организация,
//	               |	ОбъектыВРаботеОстатки.Подразделение
//	               |ПОМЕСТИТЬ Таблица
//	               |ИЗ
//	               |	Документ.ЗавершениеРаботыОрганизации.Объекты КАК ЗавершениеРаботыОрганизацииОбъекты
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(&Период, Организация = &Организация) КАК ОбъектыВРаботеОстатки
//	               |		ПО ЗавершениеРаботыОрганизацииОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
//	               |ГДЕ
//	               |	ЗавершениеРаботыОрганизацииОбъекты.Ссылка = &Ссылка
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ЗавершениеРаботыОрганизацииОбъекты.Ссылка,
//	               |	ОбъектыВРаботеОстатки.Организация,
//	               |	ОбъектыВРаботеОстатки.Подразделение,
//	               |	ЗавершениеРаботыОрганизацииОбъекты.Объект,
//	               |	ОбъектыВРаботеОстатки.Сотрудник,
//	               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	&Дата КАК Период,
//	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	               |	Таблица.Сотрудник,
//	               |	Таблица.Объект,
//	               |	Таблица.ОстатокВРаботе КАК Количество,
//	               |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
//	               |	Таблица.Организация,
//	               |	Таблица.Подразделение
//	               |ИЗ
//	               |	Таблица КАК Таблица
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	ОстатокВРаботе
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	&Дата КАК Период,
//	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	               |	ВЫБОР
//	               |		КОГДА Таблица.Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
//	               |			ТОГДА ВЫБОР
//	               |					КОГДА Таблица.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
//	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаОрганизации)
//	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаПодразделения)
//	               |				КОНЕЦ
//	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаСотрудника)
//	               |	КОНЕЦ КАК ВидСобытия,
//	               |	Таблица.Регистратор КАК ИсточникСобытия,
//	               |	Таблица.Объект,
//	               |	Таблица.Сотрудник КАК Сотрудник,
//	               |	&Автор,
//	               |	Таблица.Подразделение КАК Подразделение
//	               |ИЗ
//	               |	Таблица КАК Таблица
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	Подразделение УБЫВ,
//	               |	Сотрудник УБЫВ
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |УНИЧТОЖИТЬ Таблица";				   				   
//	Результат = Запрос.ВыполнитьПакет();
//	ТаблицаДвиженийОбъектыВРаботе = Результат[1].Выгрузить();
//	ТаблицаДвиженийСобытия = Результат[2].Выгрузить();
//	
//	//
//	Если ЭтотОбъект.ОбнулитьКатегории ИЛИ ЭтотОбъект.ОбнулитьЗадолженность Тогда
//		Запрос.УстановитьПараметр("Объекты", ЭтотОбъект.Объекты.Выгрузить().ВыгрузитьКолонку("Объект"));
//		
//	КонецЕсли;
//	
//	Если ЭтотОбъект.ОбнулитьКатегории Тогда
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	&Дата КАК Период,
//		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//		               |	СостоянияПоКатегориямОстатки.Скоринг,
//		               |	СостоянияПоКатегориямОстатки.Категория,
//		               |	СостоянияПоКатегориямОстатки.Объект,
//		               |	СостоянияПоКатегориямОстатки.КоличествоОстаток КАК Количество
//		               |ИЗ
//		               |	РегистрНакопления.СостоянияПоКатегориям.Остатки(&Период, Объект В (&Объекты)) КАК СостоянияПоКатегориямОстатки";	
//		ТаблицаДвиженийКатегории = Запрос.Выполнить().Выгрузить();
//	КонецЕсли;
//	
//	Если ЭтотОбъект.ОбнулитьЗадолженность Тогда
//		Запрос.Текст = "ВЫБРАТЬ
//		|	&Дата КАК Период,
//		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//		|	ЗадолженностьПоОбъектамОстатки.Объект КАК Объект,
//		|	ЗадолженностьПоОбъектамОстатки.СуммаДООстаток КАК СуммаДО,
//		|	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРегл,
//		|	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДО,
//		|	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРегл,
//		|	ЗадолженностьПоОбъектамОстатки.ПроцентыДООстаток КАК ПроцентыДО,
//		|	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРегл,
//		|	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРегл,
//		|	ЗадолженностьПоОбъектамОстатки.ШтрафыДООстаток КАК ШтрафыДО,
//		|	ЗадолженностьПоОбъектамОстатки.ПениДООстаток КАК ПениДО,
//		|	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток КАК ПениРегл,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая1ДООстаток КАК Составляющая1ДО,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток КАК Составляющая1Регл,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая2ДООстаток КАК Составляющая2ДО,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток КАК Составляющая2Регл,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая3ДООстаток КАК Составляющая3ДО,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток КАК Составляющая3Регл,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая4ДООстаток КАК Составляющая4ДООстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток КАК Составляющая4РеглОстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая5ДООстаток КАК Составляющая5ДООстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток КАК Составляющая5РеглОстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая6ДООстаток КАК Составляющая6ДООстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток КАК Составляющая6РеглОстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая7ДООстаток КАК Составляющая7ДООстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток КАК Составляющая7РеглОстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая8ДООстаток КАК Составляющая8ДООстаток,
//		|	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток КАК Составляющая8РеглОстаток
//		|ИЗ
//		|	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&Период, Объект В (&Объекты)) КАК ЗадолженностьПоОбъектамОстатки";	
//		ТаблицаДвиженийЗадолженность = Запрос.Выполнить().Выгрузить();
//		
//		Запрос.Текст = "ВЫБРАТЬ
//		|	&Дата КАК Период,
//		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект КАК Объект,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток КАК СуммаДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаРеглОстаток КАК СуммаРеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгДООстаток КАК ОсновнойДолгДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыДООстаток КАК ПроцентыДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыДООстаток КАК ШтрафыДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениДООстаток КАК ПениДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.ПениРеглОстаток КАК ПениРеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1ДООстаток КАК Составляющая1ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая1РеглОстаток КАК Составляющая1РеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2ДООстаток КАК Составляющая2ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая2РеглОстаток КАК Составляющая2РеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3ДООстаток КАК Составляющая3ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая3РеглОстаток КАК Составляющая3РеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4ДООстаток КАК Составляющая4ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая4РеглОстаток КАК Составляющая4РеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5ДООстаток КАК Составляющая5ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая5РеглОстаток КАК Составляющая5РеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6ДООстаток КАК Составляющая6ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая6РеглОстаток КАК Составляющая6РеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7ДООстаток КАК Составляющая7ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая7РеглОстаток КАК Составляющая7РеглОстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8ДООстаток КАК Составляющая8ДООстаток,
//		|	ЗадолженностьПоОбъектамВнесудебнаяОстатки.Составляющая8РеглОстаток КАК Составляющая8РеглОстаток
//		|ИЗ
//		|	РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки(&Период, Объект В (&Объекты)) КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки";
//		ТаблицаДвиженийЗадолженностьВнесудебная = Запрос.Выполнить().Выгрузить();
//		
//		Запрос.Текст = "ВЫБРАТЬ
//		|	&Дата КАК Период,
//		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//		|	ЗадолженностьПоСудебнымРешениямОстатки.Займ КАК Займ,
//		|	ЗадолженностьПоСудебнымРешениямОстатки.Решение КАК Решение,
//		|	ЗадолженностьПоСудебнымРешениямОстатки.ЧастьРешения КАК ЧастьРешения,
//		|	ЗадолженностьПоСудебнымРешениямОстатки.ТипЗадолженности КАК ТипЗадолженности,
//		|	ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток КАК СуммаОстаток
//		|ИЗ
//		|	РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки(&Период, Займ В (&Объекты)) КАК ЗадолженностьПоСудебнымРешениямОстатки"; 
//		ТаблицаДвиженийЗадолженностьСудебная = Запрос.Выполнить().Выгрузить();
//		
//		Запрос.Текст = "ВЫБРАТЬ
//		|	&Дата КАК Период,
//		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//		|	ИсковыеТребованияОстатки.Займ КАК Займ,
//		|	ИсковыеТребованияОстатки.СуммаОсновнойДолгОстаток КАК СуммаОсновнойДолгОстаток,
//		|	ИсковыеТребованияОстатки.СуммаПроцентыОстаток КАК СуммаПроцентыОстаток,
//		|	ИсковыеТребованияОстатки.СуммаШтрафыОстаток КАК СуммаШтрафыОстаток,
//		|	ИсковыеТребованияОстатки.СуммаПениОстаток КАК СуммаПениОстаток,
//		|	ИсковыеТребованияОстатки.ЦенаИскаОстаток КАК ЦенаИскаОстаток,
//		|	ИсковыеТребованияОстатки.СуммаГоспошлинаОстаток КАК СуммаГоспошлинаОстаток
//		|ИЗ
//		|	РегистрНакопления.ИсковыеТребования.Остатки(&Период, Займ В (&Объекты)) КАК ИсковыеТребованияОстатки";		
//		ТаблицаДвиженийЗадолженностьИск = Запрос.Выполнить().Выгрузить();
//	КонецЕсли;
//КонецПроцедуры
